Revit 2024 API
AnalysisDisplayColorEntry Constructor
 Constructs a new AnalysisDisplayColorEntry with default settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public AnalysisDisplayColorEntry()
Visual Basic
Public Sub New
Visual C++
public:
AnalysisDisplayColorEntry()
See Also
AnalysisDisplayColorEntry Class
AnalysisDisplayColorEntry Overload
Autodesk.Revit.DB.Analysis Namespace